In [2]:
import pandas as pd
import numpy as np

In [3]:
col=pd.read_csv('cost-of-living.csv')

In [4]:
col.head()

,city,country,x1,x2,x3,x4,x5,x6,x7,x8,...,x47,x48,x49,x50,x51,x52,x53,x54,x55,data_quality
0,Seoul,South Korea,7.68,53.78,6.15,3.07,4.99,3.93,1.48,0.79,...,110.36,742.54,557.52,2669.12,1731.08,22067.70,10971.90,2689.62,3.47,1
1,Shanghai,China,5.69,39.86,5.69,1.14,4.27,3.98,0.53,0.33,...,123.51,1091.93,569.88,2952.70,1561.59,17746.11,9416.35,1419.87,5.03,1
2,Guangzhou,China,4.13,28.47,4.98,0.85,1.71,3.54,0.44,0.33,...,43.89,533.28,317.45,1242.24,688.05,12892.82,5427.45,1211.68,5.19,1
3,Mumbai,India,3.68,18.42,3.68,2.46,4.30,2.48,0.48,0.19,...,41.17,522.40,294.05,1411.12,699.80,6092.45,2777.51,640.81,7.96,1
4,Delhi,India,4.91,22.11,4.30,1.84,3.68,1.77,0.49,0.19,...,36.50,229.84,135.31,601.02,329.15,2506.73,1036.74,586.46,8.06,1

In [5]:
# Select useful columns
col = col[["city", "country", "x1", "x3", "x25", "x6", "x29", "x48"]]

In [6]:
# Rename column names

In [7]:
col = col.rename(columns={
    "x1": "meal",
    "x3": "mcdonalds",
    "x25": "beer",
    "x6": "coffee",
    "x29": "monthly_pass",
    "x48": "monthly_rent"
})

In [8]:
col.head()

,city,country,meal,mcdonalds,beer,coffee,monthly_pass,monthly_rent
0,Seoul,South Korea,7.68,6.15,2.12,3.93,42.25,742.54
1,Shanghai,China,5.69,5.69,0.94,3.98,28.47,1091.93
2,Guangzhou,China,4.13,4.98,0.95,3.54,28.47,533.28
3,Mumbai,India,3.68,3.68,2.27,2.48,4.91,522.40
4,Delhi,India,4.91,4.30,1.54,1.77,11.67,229.84

In [9]:
# Define the USD to EUR exchange rate
usd_to_eur = 0.953124  # 1 USD = 0.953124 EUR as of Mar 3, 2025C

# List of columns to convert
columns_to_convert = ["meal", "mcdonalds", "beer", "coffee", "monthly_pass", "monthly_rent"]

# Convert the specified columns from USD to EUR
col[columns_to_convert] = (col[columns_to_convert] * usd_to_eur).round(2)

# Display the first few rows to verify the conversion
col.head(10)

,city,country,meal,mcdonalds,beer,coffee,monthly_pass,monthly_rent
0,Seoul,South Korea,7.32,5.86,2.02,3.75,40.27,707.73
1,Shanghai,China,5.42,5.42,0.90,3.79,27.14,1040.74
2,Guangzhou,China,3.94,4.75,0.91,3.37,27.14,508.28
3,Mumbai,India,3.51,3.51,2.16,2.36,4.68,497.91
4,Delhi,India,4.68,4.10,1.47,1.69,11.12,219.07
5,Dhaka,Bangladesh,1.86,4.65,2.29,1.86,17.66,135.43
6,Osaka,Japan,7.10,5.11,2.42,3.13,84.65,643.32
7,Jakarta,Indonesia,2.47,3.40,2.07,2.13,10.81,481.89
8,Shenzhen,China,4.07,4.75,0.84,4.00,33.92,704.12
9,Kinshasa,Congo,14.40,9.61,1.26,4.15,28.59,1906.25

In [10]:
col.shape

(4956, 8)

In [11]:
qol=pd.read_csv('Quality_of_Life.csv')

In [12]:
# Format column names: lowercase and replace spaces with underscores
qol.columns = qol.columns.str.lower().str.replace(" ", "_")

In [13]:
qol = qol.drop(columns=["purchasing_power_value", "purchasing_power_category","health_care_value", "health_care_category", "property_price_to_income_value", "property_price_to_income_category", "traffic_commute_time_value", "traffic_commute_time_category"])

In [14]:
qol.head()

,country,safety_value,safety_category,climate_value,climate_category,cost_of_living_value,cost_of_living_category,pollution_value,pollution_category,quality_of_life_value,quality_of_life_category
0,Afghanistan,25.33,'Low',0.00,NaN,21.08,'Very Low',84.44,'Very High',0.0,NaN
1,Aland Islands,71.81,'High',0.00,NaN,53.44,'Low',18.05,'Very Low',0.0,NaN
2,Albania,55.52,'Moderate',86.43,'Very High',40.85,'Low',77.25,'High',': 104.16','Low'
3,Alderney,83.79,'Very High',0.00,NaN,0.00,NaN,1.72,'Very Low',0.0,NaN
4,Algeria,47.54,'Moderate',94.82,'Very High',25.31,'Very Low',63.87,'High',': 98.83','Very Low'

In [15]:
qol.shape

(236, 11)

In [16]:
internet=pd.read_csv('Internet Speed.csv')

In [17]:
internet.head()

       country  broadband  mobile
0       Monaco     261.82     NaN
1    Singapore     255.83  105.01
2    Hong Kong     254.70   83.58
3      Romania     232.17   59.67
4  Switzerland     229.96  135.70

In [18]:
internet.shape

(177, 3)

In [19]:
nomads = pd.read_csv('Nomads_Data.csv', delimiter=';')

In [20]:
nomads

      rank              city       country  overall  cost  internet  safety
0        1           Bangkok      Thailand      4.0   5.0       2.0     4.0
1        2           Da Nang       Vietnam      4.0   5.0       1.0     4.0
2        3      Kuala Lumpur      Malaysia      4.0   5.0       2.0     4.0
3        4         Cape Town  South Africa      4.0   4.0       1.0     1.0
4        5      Buenos Aires     Argentina      3.0   5.0       2.0     3.0
...    ...               ...           ...      ...   ...       ...     ...
1363  1365  Saint Petersburg        Russia      1.0   5.0       1.0     3.0
1364  1366            Yangon       Myanmar      1.0   5.0       1.0     4.0
1365  1367           Baghdad          Iraq      1.0   5.0       1.0     2.0
1366  1368            Tehran          Iran      1.0   4.0       1.0     4.0
1367  1369            Moscow        Russia      1.0   4.0       2.0     3.0

[1368 rows x 7 columns]

In [42]:
users=pd.read_csv('people.csv')

In [50]:
users = users.drop(columns=["Unnamed: 0","followers","following"])

In [66]:
users = users.drop(columns=["education_raw"])

In [68]:
users

              username                                           work_raw
0     @lewellenmichael  Software Dev, Startup Founder, Finance, Crypto...
1         @waylandchin                                                NaN
2               @karan                                                NaN
3          @skaboss217                                                NaN
4                @apwn                                            Web Dev
...                ...                                                ...
4011         @jmspwtrs                          Startup Founder, Creative
4012     @shaunguckian                                                NaN
4013         @jrearden                               Ecommerce, Logistics
4014           @aspkin                                          Marketing
4015       @kschroeder                                                NaN

[4016 rows x 2 columns]